In [1]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.strftime.html

In [2]:
import pandas as pd
import numpy as np

In [3]:
coluna_1 = ["07APR89", "01APR96", "29JUN97", "23NOV85", "25AUG93"]
coluna_2 = ["07041989", "01041996", "29061997", "23111985", "25081993"]
coluna_3 = ["07/04/1989", "01/04/1996", "29/06/1997", "23/11/1985", "25/08/1993"]

In [4]:
df = pd.DataFrame()

df["data_1"] = coluna_1
df["data_2"] = coluna_2
df["data_3"] = coluna_3
df["resposta"] = [19890407, 19960401, 19970629, 19851123, 19930825]

In [5]:
df

    data_1    data_2      data_3  resposta
0  07APR89  07041989  07/04/1989  19890407
1  01APR96  01041996  01/04/1996  19960401
2  29JUN97  29061997  29/06/1997  19970629
3  23NOV85  23111985  23/11/1985  19851123
4  25AUG93  25081993  25/08/1993  19930825

In [6]:
sum(df["data_1"] == df["resposta"])

0

In [7]:
df["data_1"] = pd.to_datetime(df["data_1"],format='%d%b%y')
df["data_2"] = pd.to_datetime(df["data_2"],format='%d%m%Y')
df["data_3"] = pd.to_datetime(df["data_3"],format='%d/%m/%Y')
df

      data_1     data_2     data_3  resposta
0 1989-04-07 1989-04-07 1989-04-07  19890407
1 1996-04-01 1996-04-01 1996-04-01  19960401
2 1997-06-29 1997-06-29 1997-06-29  19970629
3 1985-11-23 1985-11-23 1985-11-23  19851123
4 1993-08-25 1993-08-25 1993-08-25  19930825

In [12]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timedelta.html

In [13]:
(pd.datetime.now() - df["data_1"].iloc[4]).days/365

26.293150684931508

In [14]:
pd.datetime.now()

datetime.datetime(2019, 12, 4, 20, 15, 8, 646846)

In [15]:
df["data_1"]

0   1989-04-07
1   1996-04-01
2   1997-06-29
3   1985-11-23
4   1993-08-25
Name: data_1, dtype: datetime64[ns]

In [16]:
df["data_1"].dt.strftime("%Y%m%d")

0    19890407
1    19960401
2    19970629
3    19851123
4    19930825
Name: data_1, dtype: object

In [17]:
df["data_1"] = df["data_1"].dt.strftime("%Y%m%d").astype(int)

In [18]:
df["data_2"] = df["data_2"].dt.strftime("%Y%m%d").astype(int)

In [19]:
df["data_3"] = df["data_3"].dt.strftime("%Y%m%d").astype(int)

In [20]:
df

     data_1    data_2    data_3  resposta
0  19890407  19890407  19890407  19890407
1  19960401  19960401  19960401  19960401
2  19970629  19970629  19970629  19970629
3  19851123  19851123  19851123  19851123
4  19930825  19930825  19930825  19930825

In [29]:
df["resposta"] = pd.to_datetime(df["resposta"].astype(str), format="%Y/%m/%d")

In [30]:
df["resposta"]

0   1989-04-07
1   1996-04-01
2   1997-06-29
3   1985-11-23
4   1993-08-25
Name: resposta, dtype: datetime64[ns]